---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcement
source: html/eca12543-8ee1-87c1-968d-79f6807f44f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcement Property

Can't find a host for Area Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceAreaReininforcement { get; }
```